# Pandas

## 1. Introduction to pandas Data Structures

### Series
- pd.Series(데이터(리스트 or 딕셔너리), index=리스트 )
* 기타 // isnull() : 요소마다 NaN값인지 판단해서 boolean 반환
          notnul() : 요소마다 NaN값이 아닌지 판단해서 boolean 반환

In [1]:
import pandas as pd
import numpy as np
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [2]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [3]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [6]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [7]:
'b' in obj2

True

In [8]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
#딕셔너리로 pandas 만들기

In [9]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [10]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [11]:
obj4 = pd.Series(sdata, index=states)
obj4
#인덱스 -> 리스트로

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [13]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [14]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [15]:
obj3 + obj4 #NaN과의 연산은 NaN

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [16]:
obj4.name = 'population'

In [17]:
obj4.index.name = 'state'

In [18]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### DataFrame
- pd.DataFrame(데이터=(딕셔너리), columns=(리스트), index=(리스트))
- pd.DataFrame.head() : 처음 5개 데이터를 가져옴
- pd.DataFrame['열 이름'] = pd.DataFrame.열 이름
- pd.DataFrame.loc['인덱스 이름']
- del DataFrame['인덱스' or '열이름']
- dataframe.columns = column 목록 / dataframe.columns.name = column 집합 이름
- dataframe.index = index 목록 / dataframe.index.name = index 집합 이름

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [20]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [21]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [22]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [23]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [24]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [25]:
frame2['debt'] = 16.5

In [26]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [27]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt     16.5
Name: three, dtype: object

In [28]:
frame2['debt'] = np.arange(5)

In [29]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [30]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
#인덱스마다 데이터를 한꺼번에 지정하고 싶을 때 => Series 이용

In [31]:
frame2['debt'] = val

In [32]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [33]:
frame2['eastern'] = frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [34]:
del frame2['eastern']

In [35]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [36]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
 ....: 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [37]:
frame3 = pd.DataFrame(pop)

In [38]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [39]:
frame3.index = [2001, 2002, 2003]

In [40]:
frame3

      Nevada  Ohio
2001     NaN   1.5
2002     2.4   1.7
2003     2.9   3.6

In [43]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [44]:
frame3

state  Nevada  Ohio
year
2001      NaN   1.5
2002      2.4   1.7
2003      2.9   3.6

In [45]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index Objects
- pd.Dataframe.index -> Index 객체

In [46]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [47]:
index = obj.index

In [48]:
index

Index(['a', 'b', 'c'], dtype='object')

In [59]:
index[1:]

Index(['b', 'c'], dtype='object')

## 2. Essential Functionality

### Reindex
- pd.DataFrame.reindex / -pd.Series.reindex (index리스트 or column=)
=> 이미 있는 인덱스를 가지고 재 배치하는 것임. 없는 데이터는 NaN으로 처리

In [49]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [50]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']

In [52]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [53]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [54]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)
#fill_value = : NaN값을 어떤 값으로 채울것인지?

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [60]:
obj3.reindex(range(6), method='ffill')
#method='ffill' : NaN값을 바로 직전의 값으로 채우기

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [61]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [62]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [63]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [64]:
states = ['Texas', 'Utah', 'California']

In [66]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis
- drop('인덱스') or drop('열', axis=1 / axis='columns')

In [67]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [68]:
new_obj = obj.drop('c')

In [69]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [70]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [71]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 .....: index=['Ohio', 'Colorado', 'Utah', 'New York'],
 .....: columns=['one', 'two', 'three', 'four'])

In [73]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [76]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [77]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, Selection, and Filtering
- pd.Series['인덱스이름'] / pd.Series[index number]
- pd.DataFrame['열 이름'], pd.DataFrame.열이름
- pd.DataFrame.loc['인덱스이름', '열이름']
- pd.DataFrame.iloc['인덱스번호', '열번호']

In [81]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [82]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [83]:
obj['b']

1.0

In [84]:
obj[1]

1.0

In [85]:
obj[2:]

c    2.0
d    3.0
dtype: float64

In [86]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [87]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [88]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 .....: index=['Ohio', 'Colorado', 'Utah', 'New York'],
 .....: columns=['one', 'two', 'three', 'four'])

In [89]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [90]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [91]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [92]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [93]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [94]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

### Integer Indexes
- pd.loc vs pd.iloc
: loc은 label이고, iloc은 인덱스이기 때문에 같은 숫자라도 기능이 다름.

In [95]:
ser = pd.Series(np.arange(3.))

In [96]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [98]:
ser.loc[:1] #loc은 label로 데이터를 얻는 것이기 때문에 인덱스인 1까지 접근

0    0.0
1    1.0
dtype: float64

In [99]:
ser.iloc[:1] #iloc은 index로 데이터를 얻는 것이기 때문에 인덱스 '번호'의 1까지 접근

0    0.0
dtype: float64

### Arithmetic and Data Alignment
- Series와 DataFrame은 인덱스와 열에 맞는 원소끼리 연산함
- dataframe과 series와도 인덱스 혹은 열이 매칭되는 원소가 있으면 연산 가능함

In [102]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [103]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
 .....: index=['a', 'c', 'e', 'f', 'g'])

In [104]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [105]:
s1.add(s2, fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

In [106]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
 .....: columns=list('bde'),
 .....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [108]:
series = frame.iloc[0]

In [109]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [110]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [111]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [112]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [113]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

### Function Application and Mapping
- lambda x : x 조건식
- pd.DataFrame.apply(함수) -> 기본값 : axis=0 행마다 함수 적용) => 행/열마다 적용
- pd.DataFrame.applymap(함수) -> 원소마다 적용
- pd.Series.map(함수) -> Series에서만 사용되는 함수.

In [114]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
 .....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [115]:
frame

               b         d         e
Utah   -1.429347 -1.264009  2.458078
Ohio    0.014449 -0.928898 -0.549021
Texas  -0.089651  0.509780 -0.806461
Oregon  0.662624 -2.311123 -1.023904

In [116]:
f = lambda x: x.max() - x.min()

In [117]:
frame.apply(f)

b    2.091972
d    2.820903
e    3.481982
dtype: float64

In [118]:
frame.apply(f, axis='columns')

Utah      3.887426
Ohio      0.943347
Texas     1.316242
Oregon    2.973747
dtype: float64

In [120]:
def f(x):
    return x.max() - x.min()

In [121]:
frame.apply(f)

b    2.091972
d    2.820903
e    3.481982
dtype: float64

In [122]:
format = lambda x: '%.2f' % x

In [123]:
frame.applymap(format)

            b      d      e
Utah    -1.43  -1.26   2.46
Ohio     0.01  -0.93  -0.55
Texas   -0.09   0.51  -0.81
Oregon   0.66  -2.31  -1.02

In [124]:
frame['e'].map(format)

Utah       2.46
Ohio      -0.55
Texas     -0.81
Oregon    -1.02
Name: e, dtype: object

### Sorting and Ranking
- sort_index() : index 정렬 (기본값: ascending=True, axis=0)
- sort_values() : 값 정렬 기본값: ascending=True
만약 데이터 프레임에서 sort_values() 사용시 복수의 column이 있을때, 인자로 by= 를 넣어서 기준을 정해줌
- rank() : 오름차순으로 순위를 매기는데, 똑같은 값이 있으면 원래순위/똑같은 값의 개수 를 각각 할당한다. 이때 인자로 method='first'를 주면 원래의 순위값을, mehod='max'이면 순위가 될 수 있는 최댓값을 return한다

In [125]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [127]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [128]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [129]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [130]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [131]:
obj = pd.Series([4, 7, -3, 2])

In [132]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [133]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [134]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [135]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [136]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [138]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [139]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

### Axis Indexes with Duplicate Labels
- index.is_unique : index가 유일값으로만 구성되어있는지를 boolean값으로 return

In [140]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [141]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [142]:
obj.index.is_unique

False

## 3. Summarizing and Computing Descriptive Statistics
참고 : https://pandas.pydata.org/pandas-docs/stable/api.html#api-dataframe-stats
- NaN값은 제외하고 연산 / Nan과 NaN의 연산은 NaN
- NaN 값을 포함해서 연산하고 싶으면 인자로 skipna=False를 줌

In [148]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
 .....: [np.nan, np.nan], [0.75, -1.3]],
 .....: index=['a', 'b', 'c', 'd'],
 .....: columns=['one', 'two'])

In [149]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [150]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [151]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [152]:
df.sum(axis='columns', skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [154]:
df.idxmax() #최댓값이 있는 index

one    b
two    d
dtype: object

In [155]:
df.describe() #기초통계량

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

### Unique Values, Value Counts, and Membership
- unique() : value 중 유일값만 반환
- value_counts() : 빈도수 세기

In [176]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [177]:
uniques = obj.unique()

In [178]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [179]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [181]:
mask = obj.isin(['b', 'c'])

In [182]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [183]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [184]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
 .....: 'Qu2': [2, 3, 1, 2, 3],
 .....: 'Qu3': [1, 5, 2, 4, 4]})

In [185]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [186]:
result = data.apply(pd.value_counts).fillna(0)

In [187]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0